src/ai-operator/InformationRegisters/ИИО_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИИО_Диалоги</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Словарь</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>История</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ai-operator/CommonModules/ИИО_Диалоги/Ext/Module.bsl
// Диалоги канала бота: словарь маскирования и маскированная история между ходами.
// Регистр ИИО_Диалоги ролям не доступен. Модуль читает и пишет его в привилегированном режиме
// и только для текущего пользователя: чужой диалог по ключу не прочитать.

#Область СлужебныйПрограммныйИнтерфейс

// Диалог текущего пользователя. Если записи нет или срок хранения истек - новый диалог с пустым словарем.
//
// Параметры:
//  Ключ - Строка - Идентификатор разговора в канале, например обсуждения Системы взаимодействия.
//
// Возвращаемое значение:
//  Структура:
//   * Ключ - Строка
//   * Словарь - см. ИИО_МаскированиеКлиентСервер.НовыйСловарь
//   * История - Массив из Структура - Маскированные сообщения для модели: role, content.
Функция Диалог(Ключ) Экспорт

	Результат = Новый Структура("Ключ, Словарь, История", Ключ,
		ИИО_МаскированиеКлиентСервер.НовыйСловарь(), Новый Массив);

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Диалоги.Словарь КАК Словарь,
	|	Диалоги.История КАК История
	|ИЗ
	|	РегистрСведений.ИИО_Диалоги КАК Диалоги
	|ГДЕ
	|	Диалоги.Ключ = &Ключ
	|	И Диалоги.Владелец = &Владелец
	|	И Диалоги.Изменен >= &Граница");
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("Владелец", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Граница", ГраницаСрокаХранения());
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);

	Если Выборка.Следующий() Тогда
		Словарь = Выборка.Словарь.Получить();
		История = Выборка.История.Получить();
		Если ТипЗнч(Словарь) = Тип("Структура") Тогда
			Результат.Словарь = Словарь;
		КонецЕсли;
		Если ТипЗнч(История) = Тип("Массив") Тогда
			Результат.История = История;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;

КонецФункции

// Записывает словарь и историю диалога текущего пользователя и продлевает срок хранения.
//
// Параметры:
//  Диалог - см. Диалог
Процедура Записать(Диалог) Экспорт

	Запись = РегистрыСведений.ИИО_Диалоги.СоздатьМенеджерЗаписи();
	Запись.Ключ = Диалог.Ключ;
	Запись.Владелец = Пользователи.ТекущийПользователь();
	Запись.Словарь = Новый ХранилищеЗначения(Диалог.Словарь, Новый СжатиеДанных(9));
	Запись.История = Новый ХранилищеЗначения(Диалог.История, Новый СжатиеДанных(9));
	Запись.Изменен = ТекущаяДатаСеанса();
	УстановитьПривилегированныйРежим(Истина);
	Запись.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Удаляет диалог текущего пользователя: следующий ход начнется с пустым словарем и без истории.
//
// Параметры:
//  Ключ - Строка - Идентификатор разговора в канале.
Процедура Удалить(Ключ) Экспорт

	Набор = РегистрыСведений.ИИО_Диалоги.СоздатьНаборЗаписей();
	Набор.Отбор.Ключ.Установить(Ключ);
	Набор.Отбор.Владелец.Установить(Пользователи.ТекущийПользователь());
	УстановитьПривилегированныйРежим(Истина);
	Набор.Записать();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Удаляет диалоги всех пользователей, которые не менялись дольше срока хранения
// (константа ИИО_СрокХраненияДиалоговЧас). Вызывается регламентным заданием канала.
//
// Возвращаемое значение:
//  Число - Сколько диалогов удалено.
Функция УдалитьУстаревшие() Экспорт

	Граница = ГраницаСрокаХранения();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Диалоги.Ключ КАК Ключ,
	|	Диалоги.Владелец КАК Владелец
	|ИЗ
	|	РегистрСведений.ИИО_Диалоги КАК Диалоги
	|ГДЕ
	|	Диалоги.Изменен < &Граница");
	Запрос.УстановитьПараметр("Граница", Граница);

	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	Удалено = 0;
	Пока Выборка.Следующий() Цикл
		Если УдалитьУстаревший(Выборка.Ключ, Выборка.Владелец, Граница) Тогда
			Удалено = Удалено + 1;
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Удалено;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает момент, раньше которого диалог считается устаревшим.
//
// Возвращаемое значение:
//  Дата
Функция ГраницаСрокаХранения()

	Возврат ТекущаяДатаСеанса() - ИИО_Настройки.Значение("ИИО_СрокХраненияДиалоговЧас") * 3600;

КонецФункции

// Удаляет диалог, если он не изменился после выборки: под блокировкой дата последней записи проверяется
// еще раз, чтобы не удалить диалог, который владелец продлил между выборкой и удалением.
//
// Параметры:
//  Ключ - Строка
//  Владелец - СправочникСсылка.Пользователи
//  Граница - Дата - Диалог, записанный раньше, устарел.
//
// Возвращаемое значение:
//  Булево - Истина, если диалог удален.
Функция УдалитьУстаревший(Ключ, Владелец, Граница)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИИО_Диалоги");
	ЭлементБлокировки.УстановитьЗначение("Ключ", Ключ);
	ЭлементБлокировки.УстановитьЗначение("Владелец", Владелец);

	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		Запись = РегистрыСведений.ИИО_Диалоги.СоздатьМенеджерЗаписи();
		Запись.Ключ = Ключ;
		Запись.Владелец = Владелец;
		Запись.Прочитать();
		Удален = Запись.Выбран() И Запись.Изменен < Граница;
		Если Удален Тогда
			Запись.Удалить();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ИИО_Журнал.ЗаписатьСобытие("Диалоги.Удаление", УровеньЖурналаРегистрации.Ошибка,
			Новый Структура("error", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
		ВызватьИсключение;
	КонецПопытки;
	Возврат Удален;

КонецФункции

#КонецОбласти
